In [1]:
#pandas practice

import pandas as pd
import seaborn as sns
import matplotlib.pyplot as pt

In [ ]:
df = pd.read_csv('../datasets/titanic.csv')

#1st part
df.head()

   survived  pclass  gender   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [3]:
df.columns

Index(['survived', 'pclass', 'gender', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'deck'],
      dtype='object')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   gender    891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [7]:
print(f'shape is {df.shape}')
print(f'size is {df.size}')

shape is (891, 9)
size is 8019

In [ ]:
#2nd part
df[df['age'].between(2,20)]

     survived  pclass  gender   age  sibsp  parch     fare embarked deck
7           0       3    male   2.0      3      1  21.0750        S  NaN
9           1       2  female  14.0      1      0  30.0708        C  NaN
10          1       3  female   4.0      1      1  16.7000        S    G
12          0       3    male  20.0      0      0   8.0500        S  NaN
14          0       3  female  14.0      0      0   7.8542        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
869         1       3    male   4.0      1      1  11.1333        S  NaN
875         1       3  female  15.0      0      0   7.2250        C  NaN
876         0       3    male  20.0      0      0   9.8458        S  NaN
877         0       3    male  19.0      0      0   7.8958        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B

[165 rows x 9 columns]

In [ ]:
#3rd part
df[(df['gender'] == 'female') & (df['pclass'] == 1)]

     survived  pclass  gender   age  sibsp  parch      fare embarked deck
1           1       1  female  38.0      1      0   71.2833        C    C
3           1       1  female  35.0      1      0   53.1000        S    C
11          1       1  female  58.0      0      0   26.5500        S    C
31          1       1  female   NaN      1      0  146.5208        C    B
52          1       1  female  49.0      1      0   76.7292        C    D
..        ...     ...     ...   ...    ...    ...       ...      ...  ...
856         1       1  female  45.0      1      1  164.8667        S  NaN
862         1       1  female  48.0      0      0   25.9292        S    D
871         1       1  female  47.0      1      1   52.5542        S    D
879         1       1  female  56.0      0      1   83.1583        C    C
887         1       1  female  19.0      0      0   30.0000        S    B

[94 rows x 9 columns]

In [ ]:
#4th part
avg_age_male = df['age'].where(df['gender'] == 'male').mean()
avg_age_female = df['age'].where(df['gender'] == 'female').mean()

print(f"Average male age is {avg_age_male:.0f}")
print(f"Average female age is {avg_age_female:.0f}")

Average male age is 31
Average female age is 28

In [19]:
#5th part

# df.groupby('pclass').count()
print(df.value_counts('pclass'))
df['pclass'].value_counts()

pclass
3    491
1    216
2    184
Name: count, dtype: int64

pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [ ]:
#6th part

survived_df = df[df['survived'] == 1]
not_survived_df = df[df['survived'] == 0]

print(survived_df)
print(not_survived_df)

     survived  pclass  gender   age  sibsp  parch     fare embarked deck
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
8           1       3  female  27.0      0      2  11.1333        S  NaN
9           1       2  female  14.0      1      0  30.0708        C  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
875         1       3  female  15.0      0      0   7.2250        C  NaN
879         1       1  female  56.0      0      1  83.1583        C    C
880         1       2  female  25.0      0      1  26.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
889         1       1    male  26.0      0      0  30.0000        C    C

[342 rows x 9 columns]
     survived  pclass  gender   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
4           0       3    male  35.0      0      0   8.0500        S  NaN
5           0       3    male   NaN      0      0   8.4583        Q  NaN
6           0       1    male  54.0      0      0  51.8625        S    E
7           0       3    male   2.0      3      1  21.0750        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
884         0       3    male  25.0      0      0   7.0500        S  NaN
885         0       3  female  39.0      0      5  29.1250        Q  NaN
886         0       2    male  27.0      0      0  13.0000        S  NaN
888         0       3  female   NaN      1      2  23.4500        S  NaN
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[549 rows x 9 columns]

In [ ]:
#7th part


pd.set_option('display.max_rows',None)

females_survived = survived_df[survived_df['gender'] == 'female']['gender'].count()
males_survived = survived_df[survived_df['gender'] == 'male']['gender'].count()

females_not_survived = not_survived_df[not_survived_df['gender'] == 'female']['gender'].count()
males_not_survived = not_survived_df[not_survived_df['gender'] == 'male']['gender'].count()

print(f'females_survived : {females_survived}')
print(f'males_survived : {males_survived}')
print(f'females_not_survived : {females_not_survived}')
print(f'males_not_survived : {males_not_survived}')

pd.reset_option('display.max_rows')

females_survived : 233
males_survived : 109
females_not_survived : 81
males_not_survived : 468

In [ ]:
#8th part


df.sort_values('age', ascending=False).head(3)

     survived  pclass  gender   age  sibsp  parch     fare embarked deck
630         1       1    male  80.0      0      0  30.0000        S    A
851         0       3    male  74.0      0      0   7.7750        S  NaN
493         0       1    male  71.0      0      0  49.5042        C  NaN
96          0       1    male  71.0      0      0  34.6542        C    A
116         0       3    male  70.5      0      0   7.7500        Q  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
859         0       3    male   NaN      0      0   7.2292        C  NaN
863         0       3  female   NaN      8      2  69.5500        S  NaN
868         0       3    male   NaN      0      0   9.5000        S  NaN
878         0       3    male   NaN      0      0   7.8958        S  NaN
888         0       3  female   NaN      1      2  23.4500        S  NaN

[891 rows x 9 columns]

In [ ]:
#9th part